GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f56k42.inc
;----- DMA2DPTRH Bits -----------------------------------------------------
DPTR8            EQU  H'0000'
DPTR9            EQU  H'0001'
DPTR10           EQU  H'0002'
DPTR11           EQU  H'0003'
DPTR12           EQU  H'0004'
DPTR13           EQU  H'0005'
DPTR14           EQU  H'0006'
DPTR15           EQU  H'0007'


DMA2DPTR8        EQU  H'0000'
DMA2DPTR9        EQU  H'0001'
DMA2DPTR10       EQU  H'0002'
DMA2DPTR11       EQU  H'0003'
DMA2DPTR12       EQU  H'0004'
DMA2DPTR13       EQU  H'0005'
DMA2DPTR14       EQU  H'0006'
DMA2DPTR15       EQU  H'0007'


;----- DMA2DSZL Bits -----------------------------------------------------
DSZ0             EQU  H'0000'
DSZ1             EQU  H'0001'
DSZ2             EQU  H'0002'
DSZ3             EQU  H'0003'
DSZ4             EQU  H'0004'
DSZ5             EQU  H'0005'
DSZ6             EQU  H'0006'
DSZ7             EQU  H'0007'

DMA2DSZ0         EQU  H'0000'
DMA2DSZ1         EQU  H'0001'
DMA2DSZ2         EQU  H'0002'
DMA2DSZ3         EQU  H'0003'
DMA2DSZ4         EQU  H'0004'
DMA2DSZ5         EQU  H'0005'
DMA2DSZ6         EQU  H'0006'
DMA2DSZ7         EQU  H'0007'


;----- DMA2DSZH Bits -----------------------------------------------------
DSZ8             EQU  H'0000'
DSZ9             EQU  H'0001'
DSZ10            EQU  H'0002'
DSZ11            EQU  H'0003'

DMA2DSZ8         EQU  H'0000'
DMA2DSZ9         EQU  H'0001'
DMA2DSZ10        EQU  H'0002'
DMA2DSZ11        EQU  H'0003'


;----- DMA2DSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA2DSA0         EQU  H'0000'
DMA2DSA1         EQU  H'0001'
DMA2DSA2         EQU  H'0002'
DMA2DSA3         EQU  H'0003'
DMA2DSA4         EQU  H'0004'
DMA2DSA5         EQU  H'0005'
DMA2DSA6         EQU  H'0006'
DMA2DSA7         EQU  H'0007'


;----- DMA2DSAH Bits -----------------------------------------------------
DSA8             EQU  H'0000'
DSA9             EQU  H'0001'
DSA10            EQU  H'0002'
DSA11            EQU  H'0003'
DSA12            EQU  H'0004'
DSA13            EQU  H'0005'
DSA14            EQU  H'0006'
DSA15            EQU  H'0007'


DMA2DSA8         EQU  H'0000'
DMA2DSA9         EQU  H'0001'
DMA2DSA10        EQU  H'0002'
DMA2DSA11        EQU  H'0003'
DMA2DSA12        EQU  H'0004'
DMA2DSA13        EQU  H'0005'
DMA2DSA14        EQU  H'0006'
DMA2DSA15        EQU  H'0007'


;----- DMA2SCNTL Bits -----------------------------------------------------
SCNT0            EQU  H'0000'
SCNT1            EQU  H'0001'
SCNT2            EQU  H'0002'
SCNT3            EQU  H'0003'
SCNT4            EQU  H'0004'
SCNT5            EQU  H'0005'
SCNT6            EQU  H'0006'
SCNT7            EQU  H'0007'


DMA2SCNT0        EQU  H'0000'
DMA2SCNT1        EQU  H'0001'
DMA2SCNT2        EQU  H'0002'
DMA2SCNT3        EQU  H'0003'
DMA2SCNT4        EQU  H'0004'
DMA2SCNT5        EQU  H'0005'
DMA2SCNT6        EQU  H'0006'
DMA2SCNT7        EQU  H'0007'


;----- DMA2SCNTH Bits -----------------------------------------------------
SCNT8            EQU  H'0000'
SCNT9            EQU  H'0001'
SCNT10           EQU  H'0002'
SCNT11           EQU  H'0003'


DMA2SCNT8        EQU  H'0000'
DMA2SCNT9        EQU  H'0001'
DMA2SCNT10       EQU  H'0002'
DMA2SCNT11       EQU  H'0003'


;----- DMA2SPTRL Bits -----------------------------------------------------
SPTR0            EQU  H'0000'
SPTR1            EQU  H'0001'
SPTR2            EQU  H'0002'
SPTR3            EQU  H'0003'
SPTR4            EQU  H'0004'
SPTR5            EQU  H'0005'
SPTR6            EQU  H'0006'
SPTR7            EQU  H'0007'


DMA2SPTR0        EQU  H'0000'
DMA2SPTR1        EQU  H'0001'
DMA2SPTR2        EQU  H'0002'
DMA2SPTR3        EQU  H'0003'
DMA2SPTR4        EQU  H'0004'
DMA2SPTR5        EQU  H'0005'
DMA2SPTR6        EQU  H'0006'
DMA2SPTR7        EQU  H'0007'


;----- DMA2SPTRH Bits -----------------------------------------------------
SPTR8            EQU  H'0000'
SPTR9            EQU  H'0001'
SPTR10           EQU  H'0002'
SPTR11           EQU  H'0003'
SPTR12           EQU  H'0004'
SPTR13           EQU  H'0005'
SPTR14           EQU  H'0006'
SPTR15           EQU  H'0007'


DMA2SPTR8        EQU  H'0000'
DMA2SPTR9        EQU  H'0001'
DMA2SPTR10       EQU  H'0002'
DMA2SPTR11       EQU  H'0003'
DMA2SPTR12       EQU  H'0004'
DMA2SPTR13       EQU  H'0005'
DMA2SPTR14       EQU  H'0006'
DMA2SPTR15       EQU  H'0007'


;----- DMA2SPTRU Bits -----------------------------------------------------
SPTR16           EQU  H'0000'
SPTR17           EQU  H'0001'
SPTR18           EQU  H'0002'
SPTR19           EQU  H'0003'
SPTR20           EQU  H'0004'
SPTR21           EQU  H'0005'


DMA2SPTR16       EQU  H'0000'
DMA2SPTR17       EQU  H'0001'
DMA2SPTR18       EQU  H'0002'
DMA2SPTR19       EQU  H'0003'
DMA2SPTR20       EQU  H'0004'
DMA2SPTR21       EQU  H'0005'


;----- DMA2SSZL Bits -----------------------------------------------------
SSZ0             EQU  H'0000'
SSZ1             EQU  H'0001'
SSZ2             EQU  H'0002'
SSZ3             EQU  H'0003'
SSZ4             EQU  H'0004'
SSZ5             EQU  H'0005'
SSZ6             EQU  H'0006'
SSZ7             EQU  H'0007'

DMA2SSZ0         EQU  H'0000'
DMA2SSZ1         EQU  H'0001'
DMA2SSZ2         EQU  H'0002'
DMA2SSZ3         EQU  H'0003'
DMA2SSZ4         EQU  H'0004'
DMA2SSZ5         EQU  H'0005'
DMA2SSZ6         EQU  H'0006'
DMA2SSZ7         EQU  H'0007'


;----- DMA2SSZH Bits -----------------------------------------------------
SSZ8             EQU  H'0000'
SSZ9             EQU  H'0001'
SSZ10            EQU  H'0002'
SSZ11            EQU  H'0003'

DMA2SSZ8         EQU  H'0000'
DMA2SSZ9         EQU  H'0001'
DMA2SSZ10        EQU  H'0002'
DMA2SSZ11        EQU  H'0003'


